package day11_20210413_01;

public class People {
	//객체화 할 클래스 : 필드,생성자,메소드 를 가질 수 있다.
	
	//필드 선언
	String name;
	//이클립스 상에서 필드로 인신되면 파랑색으로 표현이 된다.
	int age;
	//필드를 추가 할 때 꼭 저장을 한 후에 Main클래스에서 사용이 가능하다.
	String nation;
	
	
	//생성자 선언 -> 클래스 이름과 동일하게 선언
	//기본 생성자
	People(){
		//기본생성자의 역할 => 어떤 특정 처리가 필요한 경우에 많이 쓰임
		nation = "대한민국";
		//main클래스에서 별도로 값을 주지 않아도 main클래스에서 출력했을 때 값이 출력됨
		
	}
	
	//매개변수가 있는 생성자 선언
	//(String name, int age) => 매개변수라 한다.
	//형식 : (타입 이름, 타입 이름,,,,)
	//여러개의 매개변수가 괄호 안에 있을 수 있다.
	//매개변수의 변수명들은 갈색으로 표시가 된다.
	People(String n, int a){ 
		//People(String name, int age){ => 일반적으로 이렇게 사용한다.
		//매개변수를 사용하는 이유 => 생성자에서 필드 값을 세팅하거나 메소드에서 처리할 값을 넘길때
		
		//넘겨받은 매개변수를 필드값으로 저장
		this.name = n; //this.필드변수명 => 위에 필드선언을 하지 않으면 사용이 불가능하다.
		//this.name = name;
		//this.age = age;
		this.age = a;
		//형식 : this.매개변수이름 = 변수이름;
		//this : 필드값을 세팅할 때 일종의 규칙
		//		 매개변수이름과 필드이름은 동일하게 쓰는게 일반적이며
		//		 구분을 위해 필드앞에는 this. 을 붙인다.
		//		 this. 는 필드에 붙인다. this.를 쓰지 않으면 일반 변수로 인식을 한다.
		
		
		//String name -> name -> this.name의 순서로 값이 간다.
	}

}
